---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.TagFailures.ElementCategoryChangeInvalidatesTag
source: html/711684e8-a474-e586-2251-36b566f7c5af.htm
---
# Autodesk.Revit.DB.BuiltInFailures.TagFailures.ElementCategoryChangeInvalidatesTag Property

Elements have changed category. Tags for these elements are now of the wrong category and will be deleted.

## Syntax (C#)
```csharp
public static FailureDefinitionId ElementCategoryChangeInvalidatesTag { get; }
```